import { Vacancy } from "./definitions";

export const vacancie: Vacancy = {
    "id": 1,
    "active": true,
    "external_id": "aedc21ec-6b86-4b14-91ff-0d29c2b9e8aa",
    "company_name": "Bell Integrator",
    "title": "Тестировщик Java/QA инженер по автоматизированному тестированию Java с нуля (стажер)",
    "salary": "от 50 000 ₽",
    "location": "Москва",
    "speciality": "Java",
    "internship": true,
    "remote": false,
    "url": "https://morris-brown.org/",
    "description": `
    <p>Компания IT_ONE запускает стажировку для будущих Java разработчиков, целью которой является подготовка специалистов уровня от Junior+ до Middle-.</p>
    <p>Наши стажеры смогут получить опыт работы в профессиональной среде, развить свои навыки под руководством высококвалифицированных специалистов и открыть новые возможности для своей карьеры в IT-индустрии.</p>
    <h4>О программе:</h4>
    <ul>
<li>Период стажировки: июнь-август 2025;</li>
<li>Продолжительность 3 месяца;</li>
<li>Онлайн формат;</li>
<li>До 30 часов в неделю;</li>
<li>Обучение с тренером soft skills;</li>
<li>Работа над собственным проектом с ментором. Встречи раз в неделю по 2 часа;</li>
<li>Материалы для изучения + домашние задания + контрольные работы;</li>
<li>Этапы отбора: отправка резюме -> заполнение анкеты -> собеседование с рекрутером -> собеседование с техническим специалистом.</li>
</ul>
<h4>Ожидания от кандидата:</h4>
<ul>
<li>Мы ищем выпускников технических вузов, которые имеют базовые знания Java Core, Spring Framework, SQL.</li>
<li>Будет плюсом наличие опыта работы в технической сфере, а также в IT в целом и в разработке в частности.</li>
</ul>
<h4>Дополнительное преимущество:</h4>
<ul>
<li>Понимание ООП</li>
<li>Понимание микросервисной архитектуры и многопоточности</li>
</ul>
<h4>Что мы предлагаем после успешного прохождения стажировки:</h4>
<ul>
<li>Официальное трудоустройство по ТК РФ в аккредитованную IT-компанию;</li>
<li>Возможность удаленной работы из любого города;</li>
<li>ДМС после прохождения испытательного срока;</li>
<li>Работа в команде высококвалифицированных профессионалов;</li>
<li>Дополнительное обучение, библиотека, возможность посещения конференций, вебинаров, тренингов;</li>
<li>Корпоративные скидки от партнеров;</li>
<li>Насыщенная корпоративная культура.</li>
<ul>
    `,
    "source": "Hh.ru",
    "image": "bell.png",
    "date_publication": "2025-05-11T09:56:18.791940"
}